OF/incompressible/simpleFoam/flowAroundObstacles/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/config"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform ($Ux 0 0);
    }
    outlet
    {
        type            zeroGradient;
        /*type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);*/
    }
    lowerWall
    {
        type            noSlip;
    }
    upperWall
    {
        type            noSlip;
    }
    obstacle
    {
        type            noSlip;
    }
}


// ************************************************************************* //
