OF/incompressible/simpleFoam/flowAroundObstacles/system/sdfDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/config"

surface
{
    geometry
    {
        $stlName
        {
            type triSurfaceMesh;
            name obstacle;
        }
    }
    outputField    sdf1;
}

patches
{
    patches        (lowerWall upperWall);
    outputField    sdf2;
}

// - Optional
labels
{
    sourceField    alpha;
    inletPatches   (inlet);
    inletID        3;
    outletPatches  (outlet);
    outletID       4;
    wallPatches    (lowerWall upperWall);
    wallID         2;
    outputField    flowRegion;
}
