OF/incompressible/simpleFoam/flowAroundObstacles/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/config"

actions
(
    {
        name         obstacle;
        type         cellSet;
	scale        1;
        action       new;
	source       fieldToCell;
	/*field        alpha;
	min          -1;
	max          0.5;*/
        field        sdf1;
        min          -1e16;
        max          0;
    }
    {
        name    obstacle;
        type    cellSet;
        action  invert;
    }
);
